In [1]:
import numpy as np
import pandas as pd

In [2]:
counts=pd.Series([632,1638,569,115])
counts

0     632
1    1638
2     569
3     115
dtype: int64

In [3]:
counts.values

array([ 632, 1638,  569,  115], dtype=int64)

In [4]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
bact=pd.Series([632,1638,569,115],
               index=['firmicutes','proteobacteria','actinobacteria','bacteroidets'])
bact

firmicutes         632
proteobacteria    1638
actinobacteria     569
bacteroidets       115
dtype: int64

In [6]:
bact['actinobacteria']

569

In [7]:
bact[0]

632

In [8]:
bact.name='counts'
bact.index.name='phylum'
bact

phylum
firmicutes         632
proteobacteria    1638
actinobacteria     569
bacteroidets       115
Name: counts, dtype: int64

In [9]:
bact[bact>1000]

phylum
proteobacteria    1638
Name: counts, dtype: int64

In [10]:
np.log(bact)

phylum
firmicutes        6.448889
proteobacteria    7.401231
actinobacteria    6.343880
bacteroidets      4.744932
Name: counts, dtype: float64

In [11]:
bact_dict={'firmcutes':632,'proteobacteria':1500,'actinobacteria':550,'bacteroidets':115}
print(bact_dict)
pd.Series(bact_dict)

{'firmcutes': 632, 'proteobacteria': 1500, 'actinobacteria': 550, 'bacteroidets': 115}

firmcutes          632
proteobacteria    1500
actinobacteria     550
bacteroidets       115
dtype: int64

In [32]:
data={'Province':['FL','FL','NH','NH','ZH'],
  'Year':[2013,2014,2013,2014,2014],
  'Literacy':[0.2,0.1,0.5,0.3,0.5]}
print(data)
data=pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [33]:
df=pd.DataFrame(data,columns=['Year','Province','Literacy'])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [34]:
df['nonsense']=df.Year/df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [35]:
df['Serie_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [36]:
df.to_dict()

{'Year': {0: 2013, 1: 2014, 2: 2013, 3: 2014, 4: 2014},
 'Province': {0: 'FL', 1: 'FL', 2: 'NH', 3: 'NH', 4: 'ZH'},
 'Literacy': {0: 0.2, 1: 0.1, 2: 0.5, 3: 0.3, 4: 0.5},
 'nonsense': {0: 10065.0,
  1: 20140.0,
  2: 4026.0,
  3: 6713.333333333334,
  4: 4028.0},
 'Serie_aligned': {0: 0, 1: 1, 2: 2, 3: 3, 4: 4}}

In [37]:
pd.DataFrame(df.to_dict())

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [61]:
df=pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])
df=df.to_dict()
df

{'aa': {0: 1.0, 1: nan}, 'bb': {0: 2, 1: 3}, 'cc': {0: nan, 1: 6.0}}

In [62]:
data=[{'a':i,'b':10*i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [63]:
pd.DataFrame([{'aa':1,'bb':2},{'bb':3,'cc':6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [42]:
pd.DataFrame(np.random.randint(2,12),
             columns=['foo','bar'],
             index=['a','b','c'])

   foo  bar
a    6    6
b    6    6
c    6    6

In [22]:
ind=pd.Index([20,34,57,7,1,8])
ind

Int64Index([20, 34, 57, 7, 1, 8], dtype='int64')

In [23]:
ind[1]

34

In [24]:
ind[1:5:2]

Int64Index([34, 7], dtype='int64')

In [25]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

6 (6,) 1 int64

In [26]:
ind[1]=0

TypeError: Index does not support mutable operations

In [53]:
rng=np.random.RandomState(15)
ser=pd.Series(rng.randint(0,10,4))
ser

0    8
1    5
2    5
3    7
dtype: int32

In [54]:
dfr=pd.DataFrame(rng.randint(0,10,(5,4)),
                columns=['A','B','C','D'])
dfr

   A  B  C  D
0  0  7  5  6
1  1  7  0  4
2  9  7  5  3
3  6  8  2  1
4  1  0  5  2

In [55]:
np.exp(ser)

0    2980.957987
1     148.413159
2     148.413159
3    1096.633158
dtype: float64

In [56]:
np.sin(dfr*np.pi/4)

          A             B         C             D
0  0.000000 -7.071068e-01 -0.707107 -1.000000e+00
1  0.707107 -7.071068e-01  0.000000  1.224647e-16
2  0.707107 -7.071068e-01 -0.707107  7.071068e-01
3 -1.000000 -2.449294e-16  1.000000  7.071068e-01
4  0.707107  0.000000e+00 -0.707107  1.000000e+00

In [43]:
area=pd.Series({'alaska':17777,'texas':18888,'california':14444,},name='area')
population=pd.Series({'california':5678906,"texas":2345654,'newyork':4567809,},name='population')
print(area)
population

alaska        17777
texas         18888
california    14444
Name: area, dtype: int64

california    5678906
texas         2345654
newyork       4567809
Name: population, dtype: int64

In [44]:
population/area

alaska               NaN
california    393.167128
newyork              NaN
texas         124.187526
dtype: float64

In [ ]:
area.index | population.index

In [45]:
A=pd.Series([2,4,6],index=[0,1,2])
B=pd.Series([1,3,5],index=[1,2,3])
print(A)
print(B)
B
A+B

0    2
1    4
2    6
dtype: int64
1    1
2    3
3    5
dtype: int64

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [46]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [64]:
df

{'aa': {0: 1.0, 1: nan}, 'bb': {0: 2, 1: 3}, 'cc': {0: nan, 1: 6.0}}

In [71]:
serie_a=pd.Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],
                 index=['f','e','d','c','b','a'])
serie_b=pd.Series(np.arange(len(serie_a),dtype=np.float64),
                 index=['f','e','d','c','b','a'])

In [72]:
serie_a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [73]:
serie_b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [74]:
pd.Series(np.where(pd.isnull(serie_a),serie_b,serie_a),index=serie_a.index)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64

In [75]:
serie_a.combine_first(serie_b)

f    0.0
e    2.5
d    2.0
c    3.5
b    4.5
a    5.0
dtype: float64